[
  {
    "subreddit": "bitcoin",
    "subreddit_id": "",
    "sentiment_historical_data": [
      {
        "chunk_time_range_start": "2023-03-10T08:15:22.488741",
        "chunk_time_range_end": "2023-03-10T08:15:22.488741",
        "submissions": [
          {
            "id": "7iey6q",
            "subreddit_id": "",
            "created_timestamp": 1677189544,
            "created_timestamp_str": "2023-03-10T08:15:22.488741"
          },
          {
            "id": "7fvoxh",
            "subreddit_id": "",
            "created_timestamp": 1677189544,
            "created_timestamp_str": "2023-03-10T08:15:22.488741"
          }
        ]
      }
    ]
  }
]

{
  'chunk_time_range_start': 1443042000,
  'chunk_time_range_end': 1443042000,
  'chunk_time_range_start_str': '2015-09-23T21:00:00',
  'chunk_time_range_end_str': '2015-09-24T21:00:00',
  'submissions': [
    {
      'id': '3m8wlx',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443127828,
      'created_timestamp_str': '2015-09-24T20:50:28',
      'title': 'BitFury Reveals New Details About $100 Million Bitcoin Mine',
      'selftext': ''
    },
    {
      'id': '3m8wbl',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443127716,
      'created_timestamp_str': '2015-09-24T20:48:36',
      'title': 'Interview on the Open Forum with Andy Haldane',
      'selftext': ''
    },
    {
      'id': '3m8ufj',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443126955,
      'created_timestamp_str': '2015-09-24T20:35:55',
      'title': 'How do I go about canceling my Circle account?',
      'selftext': "I'm not going to be using bitcoin for a while now and I would like to have my information removed from the website and get rid of my account. On their website I can't find information about this. \n\nCould anyone help me out here?"
    },
    {
      'id': '3m8tuh',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443126728,
      'created_timestamp_str': '2015-09-24T20:32:08',
      'title': 'Exchange Bitcoin to PayPal, Bitcoin to Perfect Money, Bitcoin to Skrill,...',
      'selftext': ''
    },
    {
      'id': '3m8sf8',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443126127,
      'created_timestamp_str': '2015-09-24T20:22:07',
      'title': 'African Central Bankers Looking To Regulate Bitcoin',
      'selftext': ''
    },
    {
      'id': '3m8sb9',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443126084,
      'created_timestamp_str': '2015-09-24T20:21:24',
      'title': 'Paypal own your ass',
      'selftext': ''
    },
    {
      'id': '3m8s4e',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443126007,
      'created_timestamp_str': '2015-09-24T20:20:07',
      'title': 'NMTA: De-risking of Bitcoin biz should be made an anti-trust issue',
      'selftext': 'From today\'s NMTA Daily News Clippings (sent to subscribers, and will be available on website tomorrow):\n\nDear Readers,\n\nOur Top Story today tells us that virtual currency startups are leaving Australia due to lack of bank accounts.  \n\nMany people over the years have told me the banks are closing (or reject) our accounts because they want to \'steal\' our customers, and so, this should be made an anti-trust issue.\n\nI have always steadfastly maintained that nothing could be further from the truth. Banks are not closing our accounts for competitive reasons. They are doing so because of regulatory pressure. They say so, and we take them at their word.\n\nIt is also kind of obvious.\n\nBut, nevertheless, our second Top Story, shows that B of A has filed for a patent on how to use Bitcoin to send remittances, even while denying accounts to Bitcoin and remittance companies, their potential competitors. And many other banks are doing the same.\n\nSo, no, it is not that competition is motivating the problem, but the impact has anti-competitive consequences, nevertheless.\n\nBad for business, bad for innovation, bad for the consumer.\n\nI say again: it is not the fault of the banks, it is not the fault of government, yet it is a problem that must be solved, and only government can solve it.\n\nIf you are looking for the true core of the banking problem and a clue to the solution, consider this statement, also taken from our Top Story today:\n\n"Blanket classification of all bitcoin businesses and users as \'high risk\' customers is both inappropriate and disproportionate....Banking institutions should have a risk-based approach that is \'tailored to the nature, size and complexity of their business and proportionate to the level of money laundering and terrorism financing risk."\n\nThis obvious statement is the best idea we have heard from government to date. If this were the most aggressive treatment you were getting prescribed for a serious medical condition, you would change doctors.\n\nIt sounds reasonable but does not go far enough. It gives banks no reassurance and leaves them with no practicable procedure. It implies the naive hope that banks will altruistically start looking at customers individually, instead of categorically, in response to this weak reprimand. To wit, here is a recent Q &amp; A taken from IBAT\'s (the Independent Bankers Association of Texas) website:\n\n    Deposit Accounts, Money Service Business: Can We Refuse to Open These and Close Those We Have?\n\n    "Question: A new accounts person opened up an account for a check casher.  Our board is worried about the responsibilities with monitoring/due diligence and has decided NOT to have MSB accounts.  Can we close this account?\n\n    Answer\n\n    Answer: Yes. Outside of the Americans with Disabilities Act, there is no law requiring the bank to provide accounts to whoever requests one (unlike the Fair Lending laws, which prohibit discrimination).  Since the rules regarding amending accounts require 30 days notice, I prefer 30 days notice to the terminated customer.  Also, it may be difficult for this business to find another alternative.\n \nPlease note that the federal banking regulators have urged banks to not overreact to their guidance on MSB accounts and just refuse to handle these customers.  However, they didn\'t rescind their earlier [April 26, 2005] guidance."\n\nSo AUSTRAC\'s (and FATF\'s) mild guidance and reprimand, ignore and leave completely unaddressed the simple fact that there will always be legal - even regulated - businesses that deserve bank accounts when and where they are needed, yet are considered high-risk and so will be beyond the ability of most banks to vet.\n\nThis is not necessarily a bad thing; it\'s just the way it is, and will not change. But business and innovation come to a halt, consumers are left worse off and find other ways, and law enforcement loses visibility into the financial system, transparency they otherwise would have retained.\n\nMeanwhile, in our United Kingdom section, we read their government is "...seeking evidence of the impact on business of the current anti-money laundering and terrorist finance regime, and specifically the role of supervisors in that regime. [First published on June 23, 2015; the call for evidence for this review will run until Oct 23, 2015, so get your comments in now.]\n\nI believe our best path is to take further steps to allow government to routinely monitor whatever it is the banks are currently responsible for monitoring. I suggest we register these accounts, get business moving and keep non-bank channels transparent.\n\nAnd now, please enjoy today\'s Clippings!\n\nRegards,\n\n-David\n\nThe two corresponding links:\n\n- http://austrac.gov.au/media/media-releases/statement-bitcoin-and-bank-closures\n- http://coinspeaker.com/2015/09/23/bank-of-america-files-patent-that-will-let-you-send-money-using-bitcoin-12074'
    },
    {
      'id': '3m8s0d',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443125961,
      'created_timestamp_str': '2015-09-24T20:19:21',
      'title': 'Keiser Report (E814)',
      'selftext': ''
    },
    {
      'id': '3m8qwi',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443125534,
      'created_timestamp_str': '2015-09-24T20:12:14',
      'title': 'Did BitPay go bankrupt?',
      'selftext': ''
    },
    {
      'id': '3m8qpn',
      'subreddit_id': 't5_2s3qj',
      'created_timestamp': 1443125457,
      'created_timestamp_str': '2015-09-24T20:10:57',
      'title': 'Reinvent.Money Takes Place September 26 In Rotterdam - Bitcoinist.net',
      'selftext': ''
    }
  ],
  'comments': []
}





